# Assignment Day 4 Homework Solution
- Data Science 101 Course
- Name- Prakash Mandekar
- Mail Id - prakashmandekar8@gmail.com

### - Questions 1:
How to import pandas and check the version?

In [3]:
import pandas as pd

print(pd.__version__)

1.1.4

### Questions 2:
- How to create a series from a numpy array?

In [4]:
# importing Pandas & numpy 
import pandas as pd 
import numpy as np 
  
# numpy array 
data = np.array(['a', 'b', 'c', 'd', 'e']) 
  
# creating series 
s = pd.Series(data) 
print(s)

0    a
1    b
2    c
3    d
4    e
dtype: object

### Questions 3:
- How to convert the index of a series into a column of a dataframe?

In [6]:
import pandas as pd 
  
  
df = pd.DataFrame({'Roll Number': ['CSE29', 'CSE49', 'CSE36', 'CSE44'], 
                   'Name': ['Prakash', 'Raj', 'Shubham', 'Rahul'], 
                   'Marks In Percentage': [97, 90, 70, 82], 
                   'Grade': ['A', 'A', 'C', 'B'], 
                   'Subject': ['Physics', 'Physics', 'Physics', 'Physics']}) 
  
# Printing the dataframe 
df['index'] = df.index 
df

  Roll Number     Name  Marks In Percentage Grade  Subject  index
0       CSE29  Prakash                   97     A  Physics      0
1       CSE49      Raj                   90     A  Physics      1
2       CSE36  Shubham                   70     C  Physics      2
3       CSE44    Rahul                   82     B  Physics      3

### Questions 4:
- Write the code to list all the datasets available in seaborn library.
Load the 'mpg' dataset
- Note: mpg dataset will be read from seaborn module in the manner sir has already shown(provided in the
materials folder)

In [1]:
# importing seaborn
import seaborn as sns

mpg=sns.load_dataset('mpg')

print(mpg)

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
393  27.0          4  ...     usa            ford mustang gl
394  44.0          4  ...  europe                  vw pickup
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[398 rows x 9 columns]

### Questions 5:
- Which country origin cars are a part of this dataset?

In [2]:
# importing seaborn
import seaborn as sns
# importing pandas with alias name
import pandas as pd

# loading the dataset from seaborn
mpg=sns.load_dataset('mpg')

# creating a dataframe
df = pd.DataFrame(mpg)

# Displaying the country origin from where cars belong
df.origin.unique()

array(['usa', 'japan', 'europe'], dtype=object)

### Question - 6:
- Extract the part of the dataframe which contains cars belonging to 'usa'

In [3]:

# importing seaborn
import seaborn as sns
# importing pandas with alias name
import pandas as pd

# loading the dataset from seaborn
mpg=sns.load_dataset('mpg')

# creating a dataframe
df = pd.DataFrame(mpg)

# Displaying the part from dataframe where cars belong to "usa"
df[df['origin'].str.contains("usa")]

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
392  27.0          4  ...     usa           chevrolet camaro
393  27.0          4  ...     usa            ford mustang gl
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[249 rows x 9 columns]